Revit 2027 API
ParameterTypeId.SlantedColumnGeometryTreatmentBase Property
 "Base Geometry Alignment"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SlantedColumnGeometryTreatmentBase { get; }
Public Shared ReadOnly Property SlantedColumnGeometryTreatmentBase As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SlantedColumnGeometryTreatmentBase {
	ForgeTypeId^ get ();
}
static member SlantedColumnGeometryTreatmentBase : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace